fluidizedbedTest_restart/CFD/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    //wall
	CAD_patch1
    {
        type            slip;
    }
	CAD_patch3
    {

        type            slip;
    }
	fbBioin
    {
        //type            fixedValue;
        //value           uniform (0 0 0);
        type            slip;
    }
	
    fbGasin
    {
        /*type            flowRateInletVelocity;
        flowRate        0.001;
        value           uniform (0 0 0);*/

        type            fixedValue;
        value           uniform (0 0 0.3);

        //type            zeroGradient;

/*        type            groovyBC;
        variables       "Uend=vector(0,0,0.02);tEnd=0.1;";
        valueExpression "((time() < tEnd) ? Uend/tEnd*time():Uend)";
        value           uniform (0 0 0);*/

        // 2.0.x, 1.6,ext
        /*type            timeVaryingUniformFixedValue;
        fileName        "steps_0p1s";
        outOfBounds     clamp;
        value           uniform (0 0 0);*/

        // 2.1.x or higher
       // type            uniformFixedValue;
      //  uniformValue     table
        (
     //       (0.000 (0 0 0.002))
      //      (0.100 (0 0 0.020))
        //上述用于得到Umf的大小
		//然后可用这个速度模拟持续一段时间，用此命令
        //type            fixedValue;
        //value           uniform (0 0 Umf);
		);
    }

    fbOut
    {
        /*type            fluxCorrectedVelocity; //inletOutlet;
        value           uniform (0 0 0);
        inletValue      uniform (0 0 0);*/
        type            zeroGradient;
    }
}

// ************************************************************************* //
